In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import warnings
warnings.filterwarnings('ignore')

In [4]:
matrix_data= np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')

row_lebels= ['Raju','Pandey','Srini','Sunil','Ashok']

column_headings= ['Age','Height','weight']

In [6]:
df= pd.DataFrame(data= matrix_data,index= row_lebels, columns= column_headings)

print('\nA new Data Frame\n','-'*25,sep='')

df

A new Data Frame
-------------------------

        Age  Height  weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [8]:
print('\nThe Height column\n','-'*25,sep='')

print(df['Height'])

The Height column
-------------------------
Raju      66
Pandey    70
Srini     62
Sunil     68
Ashok     62
Name: Height, dtype: int32

In [12]:
print('\nType of the column:',type(df['Height']),sep='')

print('\nThe Height and Weight columns indexed by passing a list\n','-'*55,sep='')

print(df[['Height','weight']])

Type of the column:<class 'pandas.core.series.Series'>

The Height and Weight columns indexed by passing a list
-------------------------------------------------------
        Height  weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [14]:
print('\nThe Age column accessed by DOT menthod\n','-'*50,sep='') #Not recomended you can access only one column at a time.

print(df.Age)

The Age column accessed by DOT menthod
--------------------------------------------------
Raju      22
Pandey    42
Srini     30
Sunil     35
Ashok     25
Name: Age, dtype: int32

In [15]:
#Select perticular index data using loc(Index name).

df.loc['Raju']

Age        22
Height     66
weight    140
Name: Raju, dtype: int32

In [16]:
#Select perticular index data using iloc(Index position).
df.iloc[0]

Age        22
Height     66
weight    140
Name: Raju, dtype: int32

In [17]:
df

        Age  Height  weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [22]:
print('\nSelect index and column for a perticular data\n---------------------------------------------')

print(df.loc['Pandey','Height'])

Select index and column for a perticular data
---------------------------------------------
70

In [23]:
print('\nSelct index and list of columns data\n----------------------------------------')

print(df.loc['Ashok',['Height','weight']])

Selct index and list of columns data
----------------------------------------
Height     62
weight    152
Name: Ashok, dtype: int32

In [26]:
print('\nSelect list of index and columns data\n----------------------------------------')
print(df.loc[['Srini','Sunil'],['Height','weight']])

Select list of index and columns data
----------------------------------------
       Height  weight
Srini      62     125
Sunil      68     160

In [27]:
df

        Age  Height  weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [28]:
#Selct data on condition.
print('\nRows with Height > 65 inch\n','-'*30,sep='')

print(df[df['Height']>65])

Rows with Height > 65 inch
------------------------------
        Age  Height  weight
Raju     22      66     140
Pandey   42      70     148
Sunil    35      68     160

In [29]:
bloodf1=df['Height']>65
bloodf2=df['weight']>145

In [30]:
print('\nRows with height > 65 inch and weght > 145 lbs\n','-'*55,sep='')

print(df[(bloodf1) & (bloodf2)])

Rows with height > 65 inch and weght > 145 lbs
-------------------------------------------------------
        Age  Height  weight
Pandey   42      70     148
Sunil    35      68     160

In [32]:
print('\nDataFrame with only age and weight columns whoes heights are > 65 inch\n','-'*70,sep='')

print(df[bloodf1][['Age','weight']])

DataFrame with only age and weight columns whoes heights are > 65 inch
----------------------------------------------------------------------
        Age  weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [33]:
selected_candidates= df[bloodf1][['Age','weight']]

In [34]:
selected_candidates

        Age  weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [35]:
df

        Age  Height  weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [36]:
print('\nAfter resetting index\n','-'*20,sep='')
print(df.reset_index())

After resetting index
--------------------
    index  Age  Height  weight
0    Raju   22      66     140
1  Pandey   42      70     148
2   Srini   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [45]:
print('\nAge with < 35 years\n','-'*25,sep='')
df= df[df['Age']< 35]
df

Age with < 35 years
-------------------------

       Age  Height  weight
Raju    22      66     140
Srini   30      62     125
Ashok   25      62     152

In [47]:
print('\nAfter resetting index with Drop option\n','-'*40,sep='')
print(df.reset_index(drop= True))

After resetting index with Drop option
----------------------------------------
   Age  Height  weight
0   22      66     140
1   30      62     125
2   25      62     152

In [50]:
print('\nAdding a new column "Profession"\n','-'*45,sep='')
df['Profession']= "Student Teacher Engineer".split()

df

Adding a new column "Profession"
---------------------------------------------

       Age  Height  weight Profession
Raju    22      66     140    Student
Srini   30      62     125    Teacher
Ashok   25      62     152   Engineer

In [52]:
print('\nSetting "Profession" column as index\n','-'*45,sep='')

print(df.set_index('Profession'))

Setting "Profession" column as index
---------------------------------------------
            Age  Height  weight
Profession
Student      22      66     140
Teacher      30      62     125
Engineer     25      62     152